export const SUBSCRIPTION: {name: string, url: string}[] = [
  {name: "Кіно", url: "ui-ux"},
  {name: "Музика", url: "data-analyst"},
  {name: "Дизайн", url: "qa"},
  {name: "Навчання", url: "python"},
  {name: "Ігри", url: "frontend"},
  {name: "Соцмережі", url: "frontend"},
];

export const FAQS: {question: string, answer: string}[] = [
  {question: "Як купити підписку?", answer: "Оберіть підписку, яка вас цікавить, натисніть Купити, і дотримуйтесь інструкцій. Оплата проходить через захищену платіжну систему, а платформа резервує кошти до моменту підтвердження отримання підписки."},
  {question: "Як я отримаю доступ після покупки?", answer: "Після оплати продавець надає вам дані для входу або активує підписку на ваш акаунт. Ви отримаєте повідомлення у своєму профілі та на email, коли це буде зроблено."},
  {question: "Чи є гарантія, що підписка буде працювати?", answer: "Так, платформа перевіряє продавців та надає гарантію на кожну покупку. Якщо підписка неактивна або не працює, ви зможете оформити скаргу, і кошти будуть повернені."},
  {question: "Що робити, якщо продавець не передав підписку?", answer: "Якщо після покупки продавець не надав підписку протягом зазначеного часу, ви можете повідомити про проблему — підтримка втрутиться, а гроші будуть заморожені до вирішення ситуації."},
  {question: "Чи можу я повернути гроші, якщо щось піде не так?", answer: "Так, якщо підписка неактивна, недоступна або не відповідає опису, ви можете подати запит на повернення коштів через службу підтримки."},
  {question: "Чи можу я продати свою невикористану підписку?", answer: "Так, ви можете створити оголошення, вказати тип підписки, термін дії та ціну. Після перевірки модерацією ваше оголошення з'явиться на платформі."},
  {question: "Чи безпечно купувати та продавати підписки на цій платформі?", answer: "Так, всі транзакції проходять через захищений платіжний шлюз, а платформа виступає гарантом між покупцем і продавцем до моменту успішного завершення угоди."}
];
